Словарь/src/DataProcessors/ПоискДублейСловарь/ПоискДублейСловарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПоискДублейСловарь</name>
</mdclass:DataProcessor>

Словарь/src/Catalogs/Словарь/Словарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Словарь</name>
  <attributes>
    <name>ЗаписьНаЯпонском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расшифровка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСлова</name>
    <type>
      <types>EnumRef.ВидыСлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйСлог</name>
    <type>
      <types>CatalogRef.Слоги</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Слог</name>
      <type>
        <types>CatalogRef.Слоги</types>
      </type>
    </attributes>
    <attributes>
      <name>Запись</name>
      <type>
        <types>EnumRef.ВидыКаны</types>
      </type>
    </attributes>
    <attributes>
      <name>Канджи</name>
      <type>
        <types>CatalogRef.Канджи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставНовый</name>
    <attributes>
      <name>Моджи</name>
      <type>
        <types>CatalogRef.Моджи</types>
      </type>
    </attributes>
    <attributes>
      <name>Запись</name>
      <type>
        <types>EnumRef.ВидыКаны</types>
      </type>
    </attributes>
    <attributes>
      <name>Канджи</name>
      <type>
        <types>CatalogRef.Канджи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/DataProcessors/ПоискДублейСловарь/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьДублиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДубли(Команда)
	ОбновитьДублиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДубли(Команда)
	
	МассивСтрок = Элементы.Дубли.ВыделенныеСтроки;
	МассивСсылок = Новый Массив;
	Для Каждого СтрокаМассива Из МассивСтрок Цикл
		
		СсылкаНаУдаление = Дубли.НайтиПоИдентификатору(СтрокаМассива).Ссылка;    
		МассивСсылок.Добавить(СсылкаНаУдаление);
		
	КонецЦикла;
	УдалитьДублиНаСервере(МассивСсылок);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДублиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Словарь.Наименование КАК Наименование,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ втДубли
	|ИЗ
	|	Справочник.Словарь КАК Словарь
	|
	|СГРУППИРОВАТЬ ПО
	|	Словарь.Наименование
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Словарь.Ссылка КАК Ссылка,
	|	Словарь.Наименование КАК Наименование,
	|	Словарь.ЗаписьНаЯпонском КАК ЗаписьНаЯпонском,
	|	Словарь.Комментарий КАК Значение
	|ИЗ
	|	Справочник.Словарь КАК Словарь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДубли КАК втДубли
	|		ПО Словарь.Наименование = втДубли.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	Дубли.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДублиНаСервере(МассивСсылок)
	
	Для Каждого Слово Из МассивСсылок Цикл
		
		СловоОбъект = Слово.ПолучитьОбъект();
		СловоОбъект.Удалить();
		
	КонецЦикла;
	
	ОбновитьДублиНаСервере();
	
КонецПроцедуры

#КонецОбласти
